---
title: FabricationServiceButton
classe: Autodesk.Revit.DB.FabricationServiceButton
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 19
---

# FabricationServiceButton

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 ButtonIndex { get; }` | `fabricationServiceButton.ButtonIndex` | Int32 |
| `String Code { get; }` | `fabricationServiceButton.Code` | String |
| `Int32 ConditionCount { get; }` | `fabricationServiceButton.ConditionCount` | Int32 |
| `Boolean IsAHanger { get; }` | `fabricationServiceButton.IsAHanger` | Boolean |
| `Boolean IsStraight { get; }` | `fabricationServiceButton.IsStraight` | Boolean |
| `Boolean IsValidObject { get; }` | `fabricationServiceButton.IsValidObject` | Boolean |
| `String Name { get; }` | `fabricationServiceButton.Name` | String |
| `Int32 PaletteIndex { get; }` | `fabricationServiceButton.PaletteIndex` | Int32 |
| `Int32 ServiceId { get; }` | `fabricationServiceButton.ServiceId` | Int32 |
| `Boolean ContainsFabricationPartType(FabricationPartType)` | `fabricationServiceButton.ContainsFabricationPartType(partType)` | Boolean |
| `Void Dispose()` | `fabricationServiceButton.Dispose()` | Void |
| `String GetConditionDescription(Int32)` | `fabricationServiceButton.GetConditionDescription(condition)` | String |
| `Double GetConditionLowerValue(Int32)` | `fabricationServiceButton.GetConditionLowerValue(condition)` | Double |
| `String GetConditionName(Int32)` | `fabricationServiceButton.GetConditionName(condition)` | String |
| `Double GetConditionUpperValue(Int32)` | `fabricationServiceButton.GetConditionUpperValue(condition)` | Double |
| `Boolean IsExcluded()` | `fabricationServiceButton.IsExcluded()` | Boolean |
| `Boolean IsUnrestrictedCondition(Int32)` | `fabricationServiceButton.IsUnrestrictedCondition(condition)` | Boolean |
| `Boolean IsValid()` | `fabricationServiceButton.IsValid()` | Boolean |
| `Boolean IsValidConditionIndex(FabricationServiceButton, Int32)` | `FabricationServiceButton.IsValidConditionIndex(button, condition)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```